In [2]:
# 라이브러리 불러오기 
import seaborn as sns
df = sns.load_dataset('titanic')

In [3]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null category
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null category
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [6]:
# NaN이면 True, notnull : 값이 존재하면 데이터의 값, NaN 반환
# 누락된 데이터 처리 
# 제거, 치환
# 누락 데이터 확인의 과정 
print(df.head().isnull()) 
print(df['deck'].head().isnull())
print("--------------")
print(df.head().notnull()) # 값이 존재하면 값을, 없으면 NaN 출력
print("-----------------")
print(df.isnull().sum(axis=0)) # 누락된 데이터가 있는지 확인

   survived  pclass    sex    age  sibsp  parch   fare  embarked  class  \
0     False   False  False  False  False  False  False     False  False
1     False   False  False  False  False  False  False     False  False
2     False   False  False  False  False  False  False     False  False
3     False   False  False  False  False  False  False     False  False
4     False   False  False  False  False  False  False     False  False

     who  adult_male   deck  embark_town  alive  alone
0  False       False   True        False  False  False
1  False       False  False        False  False  False
2  False       False   True        False  False  False
3  False       False  False        False  False  False
4  False       False   True        False  False  False
0     True
1    False
2     True
3    False
4     True
Name: deck, dtype: bool
--------------
   survived  pclass   sex   age  sibsp  parch  fare  embarked  class   who  \
0      True    True  True  True   True   True  True      True   True  True
1      True    True  True  True   True   True  True      True   True  True
2      True    True  True  True   True   True  True      True   True  True
3      True    True  True  True   True   True  True      True   True  True
4      True    True  True  True   True   True  True      True   True  True

   adult_male   deck  embark_town  alive  alone
0        True  False         True   True   True
1        True   True         True   True   True
2        True  False         True   True   True
3        True   True         True   True   True
4        True  False         True   True   True
-----------------
survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [7]:
# 누락된 자료가 500개 이상인 자료를 제거
df_1 = df.dropna(axis=1, thresh=500) 
'deck' in (df_1.columns)

False

In [8]:
# 누락 데이터가 많은 컬럼을 제거하는 방법
# age열에 NaN값이 있으면 
# 1.행을 제거하는 방법, 2.평균으로 넣는법, 3.앞의값으로 넣는법, 4.최대빈도값 넣는법



# age 열의 NaN 값을 다른 나이 데이터의 평균으로 변경하기 
mean_age = df['age'].mean(axis=0)
df_age = df['age'].fillna(mean_age) 
# 앞의 값으로 수정
df_age_1 = df['age'].fillna(method='ffill') # method='ffill' 을 사용한다.
# 가장 빈번하게 나오는 값으로 수정
most_cnt = df['age'].value_counts(dropna=True).idxmax()
df_age_2 = df['age'].fillna(most_cnt)

In [11]:
df_age.isnull().sum(axis=0)
len(df_age)

891

In [15]:
# 중복 데이터 처리
import pandas as pd

# 중복 데이터를 갖는 데이터프레임 만들기 
df = pd.DataFrame({'c1':['a','a','b','a','b'],
                  'c2':[1,1,1,2,2],
                  'c3':[1,1,2,2,2]})

print(df)
print()
df_dup = df.duplicated() # 행의 중복을 체크
print(df_dup)

# 특정 열의 중복 체크 
df['c1'].duplicated()

# 데이터프레임에서 중복행을 제거 
df2 = df.drop_duplicates(['c2','c3'])
print(df2)
# 특정 열을 기준으로 중복행을 제거

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

0    False
1     True
2    False
3    False
4    False
dtype: bool
  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2

In [26]:
# read_csv() 함수로 df 생성
df = pd.read_csv('./auto-mpg.csv')

# 열 이름 지정
df.columns = ['mpg','cylinders','displacement','horsepower','weight',
             'acceleration','model year','origin','name']
print(df.head(3))
print('\n')

#mpg(mile per gallon)를 kpl(kilometer per liter)로 변환(mpg_to_kpl = 0.425)
mpg_to_kpl = 1.60934/3.78541

#mpg열에 0.425를 곱한 결과를 새로운 열(kpl)에 추가
df['kpl'] = df['mpg'] * mpg_to_kpl
print(df.head())
print('\n')

#kpl열을 소수점 아래 둘째자리에서 반올림
df['kpl'] = df['kpl'].round(2)
print(df.head())

    mpg  cylinders  displacement  horsepower  weight  acceleration  \
0  18.0          8         307.0         130    3504          12.0
1  15.0          8         350.0         165    3693          11.5
2  18.0          8         318.0         150    3436          11.0

   model year  origin                       name
0          70       1  chevrolet chevelle malibu
1          70       1          buick skylark 320
2          70       1         plymouth satellite


    mpg  cylinders  displacement  horsepower  weight  acceleration  \
0  18.0          8         307.0         130    3504          12.0
1  15.0          8         350.0         165    3693          11.5
2  18.0          8         318.0         150    3436          11.0
3  16.0          8         304.0         150    3433          12.0
4  17.0          8         302.0         140    3449          10.5

   model year  origin                       name       kpl
0          70       1  chevrolet chevelle malibu  7.652571
1          70       1          buick skylark 320  6.377143
2          70       1         plymouth satellite  7.652571
3          70       1              amc rebel sst  6.802286
4          70       1                ford torino  7.227428


    mpg  cylinders  displacement  horsepower  weight  acceleration  \
0  18.0          8         307.0         130    3504          12.0
1  15.0          8         350.0         165    3693          11.5
2  18.0          8         318.0         150    3436          11.0
3  16.0          8         304.0         150    3433          12.0
4  17.0          8         302.0         140    3449          10.5

   model year  origin                       name   kpl
0          70       1  chevrolet chevelle malibu  7.65
1          70       1          buick skylark 320  6.38
2          70       1         plymouth satellite  7.65
3          70       1              amc rebel sst  6.80
4          70       1                ford torino  7.23

In [47]:
# 1. 데이터 타비 확인, unique(), '?' => NaN 으로 처리 
# 2. NaN 데이터 확인 후 -> 처리 -> 0.0 값으로 치환
# 3. 데이터 타입 변경 -> float으로 변경
# horsepower 컬럼에 대해서 순서대로 처리하세요. 
import numpy as np 
df.horsepower.unique()
df_hp = df.copy()
df_hp.horsepower.replace('?', np.nan, inplace=True) # 쓰레기값 '?' 을 처리

In [56]:
df_hp['horsepower'].fillna('0.0', inplace=True)
df_hp['horsepower'] = df_hp['horsepower'].astype('float') # astype은 판다스 메소드
df_hp.dtypes
df_hp_1 = pd.to_numeric(df_hp['horsepower']) # to_numeric은 파이썬 메소드

0      130.0
1      165.0
2      150.0
3      150.0
4      140.0
       ...
387     86.0
388     52.0
389     84.0
390     79.0
391     82.0
Name: horsepower, Length: 392, dtype: float64

In [59]:
# category, 데이터 타입을 범주형 또는 문자형, 숫자형으로 원하는 형태로 변경
print(df_hp['origin'].unique()) # 정수형 데이터를 문자로 변경
df_hp['origin'].replace({1:'USA', 2:'EU', 3:'JAPAN'}, inplace=True)
print(df_hp['origin'].unique())
print(df['origin'].dtypes)
df['origin'] = df['origin'].astype('category')
print(df['origin'].dtypes)

[1 3 2]
['USA' 'JAPAN' 'EU']
int64
category